# <font color='black'>Project Title : ***Netflix Price Predction*** </font>

# <font color='blue'> Description</font>


We will use historical stock price data for Netflix to train machine learning models to predict future stock prices. The dataset includes columns such as Date, Open, High, Low, Close, Adjusted Close (Adj Close), and Volume. The 'Close' price will be our target variable, as it represents the final trading price for each day and is a key metric for investors aiming to maximize profit by buying low and selling high. The other columns ('Open', 'High', 'Low', 'Adj Close', 'Volume') serve as input features since they influence the 'Close' price and can improve the model's predictive accuracy.

Why 'Close' Price?
The 'Close' price is crucial because it reflects the stock's final value at the end of the trading day, providing insight into the stock’s daily performance. This price is affected by daily fluctuations captured in the 'Open', 'High', 'Low', and 'Adj Close' prices, as well as the trading volume. Therefore, predicting the 'Close' price helps investors decide the optimal times to buy or sell.

By using these features, our model aims to accurately predict the future 'Close' price of Netflix, allowing for informed investment decisions.

![Netflix image](image2.jpg)

## <font color ='Green'>1) Loading Libraries</font>

In [5]:
import numpy as np
import pandas as pd

In [6]:
df=pd.read_csv("netflix.csv")

In [7]:
df.head()

         Date      Open      High       Low     Close  Adj Close     Volume
0  2002-05-23  1.156429  1.242857  1.145714  1.196429   1.196429  104790000
1  2002-05-24  1.214286  1.225000  1.197143  1.210000   1.210000   11104800
2  2002-05-28  1.213571  1.232143  1.157143  1.157143   1.157143    6609400
3  2002-05-29  1.164286  1.164286  1.085714  1.103571   1.103571    6757800
4  2002-05-30  1.107857  1.107857  1.071429  1.071429   1.071429   10154200

In [8]:
df.shape # dataset has 5044 rows and 9 columns

(5044, 7)

**Observation:**
<font color='Red'>1) We have Total 5044 number of Rows and 9 Columns in the Dataset.</font>

## Data Preprocessing

<font color='orange'>**Data Preprocessing have some steps involved:**</font>

1)Loading and Inspecting the Data: Read data and check its structure.

2)Feature Engineering: Convert date column to datetime and extract useful features (year, month, day).

3)Cleaning Data: Remove unnecessary columns and check for missing values and duplicates.

4)Scaling and Normalization: Apply normalization to ensure that all features contribute equally to the model.

5)Data Splitting: Split the data into training and test sets to evaluate model performance.

## <font color ='Green'>2) Feature Engineering</font>
Extracts the 'year', 'month', and 'day' from the datetime object and stores them in new columns. This step allows you to use these temporal features as inputs for the prediction model.

In [13]:
df['Date'] = pd.to_datetime(df['Date'])
df['year'] = df['Date'].dt.year
df['month'] = df['Date'].dt.month
df['day'] = df['Date'].dt.day

In [14]:
df.head(3)
##Display the first 3 rows of the dataset to understand its structure and content.

,Date,Open,High,Low,Close,Adj Close,Volume,year,month,day
0,2002-05-23,1.156429,1.242857,1.145714,1.196429,1.196429,104790000,2002,5,23
1,2002-05-24,1.214286,1.225000,1.197143,1.210000,1.210000,11104800,2002,5,24
2,2002-05-28,1.213571,1.232143,1.157143,1.157143,1.157143,6609400,2002,5,28

In [15]:
##Remove the 'Date' column since it's no longer needed after extracting the year, month, and day information.
df.drop('Date',axis=1,inplace=True)

In [16]:
df

,Open,High,Low,Close,Adj Close,Volume,year,month,day
0,1.156429,1.242857,1.145714,1.196429,1.196429,104790000,2002,5,23
1,1.214286,1.225000,1.197143,1.210000,1.210000,11104800,2002,5,24
2,1.213571,1.232143,1.157143,1.157143,1.157143,6609400,2002,5,28
3,1.164286,1.164286,1.085714,1.103571,1.103571,6757800,2002,5,29
4,1.107857,1.107857,1.071429,1.071429,1.071429,10154200,2002,5,30
...,...,...,...,...,...,...,...,...,...
5039,193.190002,195.250000,190.369995,195.190002,195.190002,8586000,2022,5,27
5040,196.179993,199.949997,190.800003,197.440002,197.440002,11398500,2022,5,31
5041,198.699997,202.740005,191.660004,192.910004,192.910004,8416200,2022,6,1
5042,192.020004,205.470001,191.720001,205.089996,205.089996,9623100,2022,6,2
5043,200.139999,202.949997,198.050003,198.979996,198.979996,7181700,2022,6,3